In [1]:
# UNION in MySQL - 
# The UNION operator is used to combine the result sets of two or more SELECT statements into a single result.

# It helps when:

# You're pulling similar data from different tables.
# You want to merge results from multiple queries into one list.

In [1]:
#------------MY--Understanding-------------------

# Union - It combines the results of multiple SELECT statements and removes duplicate rows from the final result set.
# UNION ALL - It also combines the results of multiple SELECT statements — but keeps duplicates.

    
# Select two tables in the middle write UNION, and it will combine the two tables the two columns names mentioned on the first select statement. 
# Example - 
# #---------------code---------------------
# SELECT name , students_id FROM students;
# UNION 
# SELECT email, address FROM marks;
# #----------------------------------------
# Output - It will combine the results in the first selected columns, and removes the duplicate items, if any, because we used UNION.

In [2]:
# When UNION Works - 
    
# Same number of columns in all SELECT statements.
# Compatible data types in corresponding columns.
# Columns will be matched by position, not by name.


#---------code--------------------    
# SELECT name, city FROM customers
# UNION
# SELECT name, city FROM vendors;
#---------------------------------
# This combines names and cities from both tables into a single result.

In [3]:
# When UNION Doesn't Work - 

# If the number of columns is different:
# #-----------code-----------------------
# -- This will throw an error
# SELECT name, city FROM customers
# UNION
# SELECT name FROM vendors;

# #-----------------------------------------------------
# If the data types don’t match:
# #--------------code-----------------------------------
# -- Error if 'age' is an integer and 'name' is a string
# SELECT age FROM users
# UNION
# SELECT name FROM students;
# #----------------------------------
# MySQL will complain that the columns can't be matched due to type mismatch.

In [4]:
# UNION vs UNION ALL - 
# By default, UNION removes duplicate rows. If you want to keep duplicates, use UNION ALL:

# #------------code------------
# SELECT name FROM students
# UNION ALL
# SELECT name FROM alumni;
# #----------------------------
# Use UNION if:

# You want a clean list without duplicates.
# Use UNION ALL if:

# You want performance and don’t care about duplicates.
# Or you expect duplicate values and want to preserve them.

In [5]:
# Practical Use Case Example
# Let’s say you have two tables: students_2023 and students_2024.

# #---------------code------------------
# SELECT name, batch FROM students_2023
# UNION
# SELECT name, batch FROM students_2024;
# #-------------------------------------
# This gives a combined list of all students across both years, without duplicates.

In [ ]:
# Sorting the Combined Result
# You can sort the final output using ORDER BY at the end:

# #----------code-----------------------
# SELECT name FROM students_2023
# UNION
# SELECT name FROM students_2024
# ORDER BY name;